Revit 2027 API
BuiltInFailures.SiteFailures.SitePhasesDontOverlap Property
 The phases of the two surfaces you are merging do not overlap. You can continue the operation, or cancel it and select a different pair of surfaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SitePhasesDontOverlap { get; }
Public Shared ReadOnly Property SitePhasesDontOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SitePhasesDontOverlap {
	FailureDefinitionId^ get ();
}
static member SitePhasesDontOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace